#> time_limit:fishing/creature/

# mobを抽選します

# 1~15の乱数を取得
data modify storage math: in set value [1,15]
function #math:dice
# 乱数結果を代入する
execute store result score _ TUSB run data get storage math: out.sum

#不運エフェクト付与(イベントとして)
#kao
#TNT(爆発しない)
#ガーディアン系
#シミック 43.9 4.39
#アイアンゴーレム(バスティオンって名前つけるかｗ)
#まもる君改(頭がオブザーバー)
#スキル設定場の亡霊(頭エストにmainhand釣り竿、オフハンド時送り)
#深淵様(ワープだけ+ちょい弱体化)、トカルト通貨がもらえる(イベント)
#パール投げた時にでてくるあれ(エンダーマイトのなんか)
#賑やかしアイ(ゾンビ部分だけ、デバフなし)
#クラーケン(蜘蛛反転+ひかりイカ)
#バニラの海mob(ガーディアン、エルダーガーディアン、ドラウンド、イカ、ヒカリイカ、フグ)
#ファントム(エイみたいに見えん、、?)
#エメブロもらえるイベント
#ハチ
#アレイ(微妙かも)
#